task3/taskk3/app/controllers/companies_controller.rb

INSERT INTO "companies" ("company_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["company_name", "Samsung"], ["created_at", "2021-10-25 13:35:15.221014"], ["updated_at", "2021-10-25 13:35:15.221014"]]
---
  def create
    @company = Company.create(
      company_name: params[:company_name]
    )

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "companies" SET "company_name" = $1, "updated_at" = $2 WHERE "companies"."id" = $3  [["company_name", "HUWAVEi"], ["updated_at", "2021-10-26 13:59:30.017273"], ["id", 5]]
---
  def update
    @company = Company.find(params[:id])
    @company.update(
      company_name: params[:company_name]
    )

SELECT "companies".* FROM "companies"
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "companies" WHERE "companies"."id" = $1  [["id", 3]]
---
  def destroy
    @companies = Company.all
    @company = Company.find(params[:id])
    @company.destroy