task3/taskk3/app/controllers/orders_controller.rb

  def create
    @phone = Phone.find(params[:phone_id])
    @order = Order.create(
      phone_id: params[:phone_id],
      user_id: params[:user_id],
      count: params[:count],
      date: params[:date],
      sum: params[:count].to_i * @phone.price
    )
---
SELECT "phones".* FROM "phones" WHERE "phones"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "orders" ("phone_id", "user_id", "count", "date", "sum", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["phone_id", 1], ["user_id", 1], ["count", 5], ["date", "6 october 2021"], ["sum", 1000], ["created_at", "2021-10-25 20:24:58.859130"], ["updated_at", "2021-10-25 20:24:58.859130"]]

  def destroy
    @orders = Order.all
    @order = Order.find(params[:id])
    @order.destroy
---
SELECT "orders".* FROM "orders"
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 6]]