task3/taskk3/app/controllers/phones_controller.rb

SELECT "phones".* FROM "phones"
---
  def index
    @phones = Phone.all

INSERT INTO "phones" ("phone_name", "price", "provider_id", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["phone_name", "Iphone 7 plus"], ["price", 200], ["provider_id", 1], ["company_id", 1], ["created_at", "2021-10-25 15:48:49.897102"], ["updated_at", "2021-10-25 15:48:49.897102"]]
---
  def create
    @phone = Phone.create(
      phone_name: params[:phone_name],
      price: params[:price],
      provider_id: params[:provider_id],
      company_id: params[:company_id]
    )

SELECT "phones".* FROM "phones"
SELECT "phones".* FROM "phones" WHERE "phones"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "phones" WHERE "phones"."id" = $1  [["id", 3]]
---
  def destroy
    @phones = Phone.all
    @phone = Phone.find(params[:id])
    @phone.destroy