task3/taskk3/app/controllers/providers_controller.rb

INSERT INTO "providers" ("provider_name", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["provider_name", "Andrey"], ["phone_number", " 3759872453"], ["created_at", "2021-10-26 14:15:19.585323"], ["updated_at", "2021-10-26 14:15:19.585323"]]
---
  def create
    @provider = Provider.create(
      provider_name: params[:provider_name],
      phone_number: params[:phone_number]
    )

SELECT "providers".* FROM "providers" WHERE "providers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "providers" SET "provider_name" = $1, "phone_number" = $2, "updated_at" = $3 WHERE "providers"."id" = $4  [["provider_name", "Nikita"], ["phone_number", "3759872453"], ["updated_at", "2021-10-26 14:15:44.231786"], ["id", 2]]
---
  def update
    @provider = Provider.find(params[:id])
    @provider.update(
      provider_name: params[:provider_name],
      phone_number: params[:phone_number]
    )