task3/taskk3/app/controllers/users_controller.rb

  def create
    @user = User.create(
      user_name: params[:user_name],
      phone_number: params[:phone_number]
    )
---
INSERT INTO "users" ("user_name", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_name", "dima"], ["phone_number", " 375295480141"], ["created_at", "2021-10-26 14:05:35.652667"], ["updated_at", "2021-10-26 14:05:35.652667"]]

  def update
    @user = User.find(params[:id])
    @user.update(
      user_name: params[:user_name],
      phone_number: params[:phone_number]
    )
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "user_name" = $1, "phone_number" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["user_name", ""], ["phone_number", " 375295480142"], ["updated_at", "2021-10-26 14:06:03.732704"], ["id", 2]]