Mailer/app/controllers/users_controller.rb

  def create

    @user = User.create(
      name: params[:name],
      email: params[:email],
      login: params[:login]
    )
---
INSERT INTO "users" ("name", "email", "login", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "dowr2"], ["email", "dowr.atayew@mail.ru"], ["login", "dowr2111"], ["created_at", "2021-11-16 16:18:55.282495"], ["updated_at", "2021-11-16 16:18:55.282495"]]