example/app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "articles" SET "updated_at" = ?, "status" = ? WHERE "articles"."id" = ?  [["updated_at", "2021-10-20 16:12:10.740457"], ["status", "private"], ["id", 1]]