rails-sidekiq/app/workers/add_endangered_worker.rb

  def perform(csv_file)
    CSV.foreach(csv_file, headers: true) do |shark|
      Endangered.create(name: shark[0], iucn: shark[1])
---
INSERT INTO "endangereds" ("name", "iucn", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "pelagic-thresher-shark"], ["iucn", "vu"], ["created_at", "2021-12-01 11:41:10.434597"], ["updated_at", "2021-12-01 11:41:10.434597"]]