rails-sidekiq/app/workers/remove_endangered_worker.rb

DELETE FROM "endangereds" WHERE "endangereds"."id" = ?  [["id", 1]]
---
  def perform
    Endangered.destroy_all